example/throttle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          51;
        startFace       57362;
    }
    outlet
    {
        type            patch;
        nFaces          51;
        startFace       57413;
    }
    walls
    {
        type            wall;
        nFaces          836;
        startFace       57464;
    }
    frontBack
    {
        type            empty;
        nFaces          57540;
        startFace       58300;
    }
)


// ************************************************************************* //
