example/throttle/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha1
    {
        maxUnboundedness 1e-5;
        CoCoeff          0.2;
        nLimiterIter     2;

        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-13;
        relTol           0;
        maxIter          5;
    };

    U
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0;
        maxIter          5;
    };

    "(pd|p)"
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0;

        smoother         DICGaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 256;
        agglomerator     faceAreaPair;
        mergeLevels      1;

        maxIter          200;
    };

    "(pcorr|p)"
    {
        $pd;
        relTol           0;
    };

    pdFinal
    {
        solver            PCG;
        preconditioner
        {
            preconditioner  GAMG;

            tolerance        1e-8;
            relTol           0;

            nVcycles         2;

            smoother         DICGaussSeidel;
            nPreSweeps       0;
            nPostSweeps      2;
            nFinestSweeps    2;

            cacheAgglomeration false;
            nCellsInCoarsestLevel 256;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };
        tolerance        1e-8;
        relTol           0;
        maxIter          200;
    };

    k
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
        maxIter          5;
    }
    omega
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
        maxIter          5;
    }
}

PIMPLE
{
    momentumPredictor          yes;
    nOuterCorrectors           1;
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;

    nAlphaCorr                 1;
    nAlphaSubCycles            1;

    residualControl
    {
        "(pd|U|k|omega)"
        {
            tolerance          1e-3;
            relTol             0;
        }
    }
}


PISO
{
    cAlpha                     0;
}

RK4
{
}

relaxationFactors
{
    fields
    {// do not relax in Final iter, for equations it does not matter
        "(pd)"               1.0;
        "(nuSgs)"           1.0; 
    }
    equations
    {
        "U.*"                 1;
        "k.*"                 1;
        "omega.*"             1;
    }
}


// ************************************************************************* //
